Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LVGL/lvgl_app.c
    if(code == LV_EVENT_CLICKED) {
        void *user_data = lv_event_get_user_data(e);
        lv_obj_t *target_screen = (lv_obj_t *)user_data;
        /* Safety: ignore clicks with NULL target to avoid passing NULL to LVGL */
        if (target_screen == NULL) return;
        lv_screen_load_anim(target_screen,
                    LV_SCR_LOAD_ANIM_FADE_ON,
                    300,
                    0,
                    false);

    }
}

static void pin_item_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if (code != LV_EVENT_CLICKED) return;

    const PinInfo *info = (const PinInfo *)lv_event_get_user_data(e);
    if (info == NULL) return;

    uint8_t idx = pin_index(info->pin);
    const char *port_name = pin_port_name(info->port);
    const char *nature = pin_nature_from_name(info->name);
    GPIO_PinState state = HAL_GPIO_ReadPin(info->port, info->pin);

    char buf[64];
    lv_snprintf(buf, sizeof(buf), "Pin: %s", info->name);
    lv_label_set_text(pin_name_label, buf);

    lv_snprintf(buf, sizeof(buf), "Port: %s / %u", port_name, idx);
    lv_label_set_text(pin_port_label, buf);

    lv_snprintf(buf, sizeof(buf), "Nature: %s", nature);
    lv_label_set_text(pin_nature_label, buf);

    lv_snprintf(buf, sizeof(buf), "State: %s", state == GPIO_PIN_SET ? "HIGH" : "LOW");
    lv_label_set_text(pin_state_label, buf);

    lv_screen_load_anim(scr_pin_detail, LV_SCR_LOAD_ANIM_FADE_ON, 200, 0, false);
}

/*=============================================================================
 * SCREEN CREATION FUNCTIONS
 *===========================================================================*/
/* Each function below creates one complete screen with all its widgets.
 *
 * Pattern Used (same for every widget):
 * 1. CREATE:    lv_widget_create(parent)
 * 2. CONFIGURE: lv_obj_set_size(), lv_obj_set_style_xxx()
 * 3. POSITION:  lv_obj_align()
 *
 * Read create_home_screen() first - it's the simplest!
 */

/*-----------------------------------------------------------------------------
 * Create Home Dashboard Screen
 *---------------------------------------------------------------------------*/
/* This is the main screen users see first.
 * Contains: Title, Status card, Temperature gauge, Humidity bar, 2 buttons
 */
static void create_home_screen(void)
{
    scr_home = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_home, lv_color_hex(0x1a1a2e), 0);

    /* Title Bar */
    lv_obj_t *title = lv_label_create(scr_home);
    lv_label_set_text(title, "STM32F429 Dashboard");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

    /* Status Card - Moved lower to avoid overlap with title */
    lv_obj_t *status_card = lv_obj_create(scr_home);
    lv_obj_set_size(status_card, 150, 40);  /* Smaller size for testing */
    lv_obj_align(status_card, LV_ALIGN_TOP_MID, 0, 45);
    lv_obj_set_style_bg_color(status_card, lv_color_hex(0x00ff00), 0);  /* Green background for debugging */
    lv_obj_set_style_border_color(status_card, lv_color_hex(0x0f4c75), 0);
    lv_obj_set_style_border_width(status_card, 2, 0);

    status_label = lv_label_create(status_card);
    lv_label_set_text(status_label, "System Ready");
    lv_obj_set_style_text_color(status_label, lv_color_white(), 0);  /* White text for debugging */
    lv_obj_set_style_text_font(status_label, &lv_font_montserrat_16, 0);
    lv_obj_set_style_text_align(status_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_pos(status_label, 10, 10);  /* Position at 10,10 within the card */

    /* Temperature Arc Gauge - Repositioned lower */
    temp_arc = lv_arc_create(scr_home);
    lv_obj_set_size(temp_arc, 80, 80);
    lv_obj_align(temp_arc, LV_ALIGN_TOP_LEFT, 20, 140);
    lv_arc_set_rotation(temp_arc, 135);
    lv_arc_set_bg_angles(temp_arc, 0, 270);
    lv_arc_set_value(temp_arc, 25);
    lv_obj_set_style_arc_color(temp_arc, lv_color_hex(0xff6b6b), LV_PART_INDICATOR);
    lv_obj_set_style_arc_width(temp_arc, 8, LV_PART_INDICATOR);

    temp_label = lv_label_create(scr_home);
    lv_label_set_text(temp_label, "25°C\nTemp");
    lv_obj_set_style_text_color(temp_label, lv_color_white(), 0);
    lv_obj_set_style_text_font(temp_label, &lv_font_montserrat_16, 0);
    lv_obj_set_style_text_align(temp_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align_to(temp_label, temp_arc, LV_ALIGN_CENTER, 0, 0);

    /* Humidity Bar - Repositioned to avoid overlap */
    lv_obj_t *hum_container = lv_obj_create(scr_home);
    lv_obj_set_size(hum_container, 80, 80);
    lv_obj_align(hum_container, LV_ALIGN_TOP_RIGHT, -20, 130);
    lv_obj_set_style_bg_color(hum_container, lv_color_hex(0x16213e), 0);
    lv_obj_set_style_border_width(hum_container, 0, 0);

    humidity_bar = lv_bar_create(hum_container);
    lv_obj_set_size(humidity_bar, 15, 60);
    lv_obj_center(humidity_bar);
    lv_bar_set_value(humidity_bar, 60, LV_ANIM_ON);
    lv_obj_set_style_bg_color(humidity_bar, lv_color_hex(0x4ecdc4), LV_PART_INDICATOR);

    humidity_label = lv_label_create(hum_container);
    lv_label_set_text(humidity_label, "60%\nHumid");
    lv_obj_set_style_text_color(humidity_label, lv_color_white(), 0);
    lv_obj_set_style_text_align(humidity_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(humidity_label, LV_ALIGN_BOTTOM_MID, 0, -5);

    /* Navigation Buttons - Repositioned lower */
    lv_obj_t *btn_sensors = lv_btn_create(scr_home);
    lv_obj_set_size(btn_sensors, 100, 40);
    lv_obj_align(btn_sensors, LV_ALIGN_BOTTOM_LEFT, 10, -10);
    lv_obj_set_style_bg_color(btn_sensors, lv_color_hex(0x3be477), 0);
    /* Register callback after all screens are created */
    btn_home_sensors = btn_sensors;

    lv_obj_t *lbl_sensors = lv_label_create(btn_sensors);
    lv_label_set_text(lbl_sensors, LV_SYMBOL_LIST " Sensors");
    lv_obj_center(lbl_sensors);

    lv_obj_t *btn_settings = lv_btn_create(scr_home);
    lv_obj_set_size(btn_settings, 100, 40);
    lv_obj_align(btn_settings, LV_ALIGN_BOTTOM_RIGHT, -10, -10);
    lv_obj_set_style_bg_color(btn_settings, lv_color_hex(0xf7b731), 0);
    /* Register callback after all screens are created */
    btn_home_settings = btn_settings;

