Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LVGL/lvgl_app.c
    lv_obj_t *lbl_settings = lv_label_create(btn_settings);
    lv_label_set_text(lbl_settings, LV_SYMBOL_SETTINGS " Config");
    lv_obj_center(lbl_settings);

    lv_obj_t *btn_pins = lv_btn_create(scr_home);
    lv_obj_set_size(btn_pins, 90, 36);
    lv_obj_align(btn_pins, LV_ALIGN_BOTTOM_MID, 0, -10);
    lv_obj_set_style_bg_color(btn_pins, lv_color_hex(0x4ecdc4), 0);
    btn_home_pins = btn_pins;

    lv_obj_t *lbl_pins = lv_label_create(btn_pins);
    lv_label_set_text(lbl_pins, LV_SYMBOL_LIST " Pins");
    lv_obj_center(lbl_pins);
}

/*-----------------------------------------------------------------------------
 * Create Sensor Monitoring Screen
 *---------------------------------------------------------------------------*/
/* This screen shows live sensor data visualization.
 * Contains: Title, Line chart, 4 sensor value cards, Back button
 */
static void create_sensor_screen(void)
{
    scr_sensors = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_sensors, lv_color_hex(0x1a1a2e), 0);

    /* Title */
    lv_obj_t *title = lv_label_create(scr_sensors);
    lv_label_set_text(title, LV_SYMBOL_EYE_OPEN " Sensor Monitor");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

    /* Chart */
    chart_sensor = lv_chart_create(scr_sensors);
    lv_obj_set_size(chart_sensor, 200, 120);
    lv_obj_align(chart_sensor, LV_ALIGN_CENTER, 0, -20);
    lv_chart_set_type(chart_sensor, LV_CHART_TYPE_LINE);
    lv_chart_set_range(chart_sensor, LV_CHART_AXIS_PRIMARY_Y, 0, 100);
    lv_obj_set_style_bg_color(chart_sensor, lv_color_hex(0x16213e), 0);

    /* Add data series */
    chart_series = lv_chart_add_series(chart_sensor, lv_color_hex(0x3be477), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_set_point_count(chart_sensor, 10);
    uint16_t sample_data[] = {10, 20, 35, 45, 50, 55, 60, 70, 65, 50};
    for(int i = 0; i < 10; i++) {
        lv_chart_set_next_value(chart_sensor, chart_series, sample_data[i]);
    }

    /* Sensor Value Cards */
    const char *sensor_names[] = {"Accel", "Gyro", "Temp", "Press"};
    const char *sensor_values[] = {"1.2g", "45°/s", "25°C", "1013"};
    uint32_t colors[] = {0xff6b6b, 0x4ecdc4, 0xf7b731, 0xa29bfe};

    for(int i = 0; i < 4; i++) {
        lv_obj_t *card = lv_obj_create(scr_sensors);
        lv_obj_set_size(card, 50, 50);
        lv_obj_align(card, LV_ALIGN_BOTTOM_LEFT, 10 + (i * 55), -50);
        lv_obj_set_style_bg_color(card, lv_color_hex(colors[i]), 0);
        lv_obj_set_style_border_width(card, 0, 0);

        lv_obj_t *name = lv_label_create(card);
        lv_label_set_text(name, sensor_names[i]);
        lv_obj_set_style_text_font(name, &lv_font_montserrat_14, 0);
        lv_obj_align(name, LV_ALIGN_TOP_MID, 0, -6);

        lv_obj_t *value = lv_label_create(card);
        lv_label_set_text(value, sensor_values[i]);
        lv_obj_set_style_text_font(value, &lv_font_montserrat_14, 0);
        lv_obj_align(value, LV_ALIGN_BOTTOM_MID, 0, -0.5);
    }

    /* Back Button */
    lv_obj_t *btn_back = lv_btn_create(scr_sensors);
    lv_obj_set_size(btn_back, 60, 35);
    lv_obj_align(btn_back, LV_ALIGN_TOP_LEFT, 5, 5);
    lv_obj_set_style_bg_color(btn_back, lv_color_hex(0x5f6368), 0);
    /* Register callback after all screens are created */
    btn_sensors_back = btn_back;

    lv_obj_t *lbl_back = lv_label_create(btn_back);
    lv_label_set_text(lbl_back, LV_SYMBOL_LEFT " Back");
    lv_obj_center(lbl_back);
}

/*-----------------------------------------------------------------------------
 * Create Settings Screen
 *---------------------------------------------------------------------------*/
/* This screen allows user configuration.
 * Contains: Title, 2 sliders (brightness/volume), 2 switches (WiFi/BT),
 *           System Info button, Back button
 */
static void create_settings_screen(void)
{
    scr_settings = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_settings, lv_color_hex(0x1a1a2e), 0);

    /* Title */
    lv_obj_t *title = lv_label_create(scr_settings);
    lv_label_set_text(title, LV_SYMBOL_SETTINGS " Settings");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

    /* Brightness Slider */
    lv_obj_t *bright_label = lv_label_create(scr_settings);
    lv_label_set_text(bright_label, "Brightness");
    lv_obj_set_style_text_color(bright_label, lv_color_white(), 0);
    lv_obj_align(bright_label, LV_ALIGN_TOP_LEFT, 20, 50);

    lv_obj_t *slider_bright = lv_slider_create(scr_settings);
    lv_obj_set_size(slider_bright, 180, 10);
    lv_obj_align(slider_bright, LV_ALIGN_TOP_LEFT, 20, 75);
    lv_slider_set_value(slider_bright, 70, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(slider_bright, lv_color_hex(0xf7b731), LV_PART_INDICATOR);

    /* Volume Slider */
    lv_obj_t *vol_label = lv_label_create(scr_settings);
    lv_label_set_text(vol_label, "Volume");
    lv_obj_set_style_text_color(vol_label, lv_color_white(), 0);
    lv_obj_align(vol_label, LV_ALIGN_TOP_LEFT, 20, 110);

    lv_obj_t *slider_vol = lv_slider_create(scr_settings);
    lv_obj_set_size(slider_vol, 180, 10);
    lv_obj_align(slider_vol, LV_ALIGN_TOP_LEFT, 20, 135);
    lv_slider_set_value(slider_vol, 50, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(slider_vol, lv_color_hex(0x4ecdc4), LV_PART_INDICATOR);

    /* Toggle Switches */
    lv_obj_t *wifi_label = lv_label_create(scr_settings);
    lv_label_set_text(wifi_label, "WiFi");
    lv_obj_set_style_text_color(wifi_label, lv_color_white(), 0);
    lv_obj_align(wifi_label, LV_ALIGN_TOP_LEFT, 20, 170);

    lv_obj_t *sw_wifi = lv_switch_create(scr_settings);
    lv_obj_align(sw_wifi, LV_ALIGN_TOP_RIGHT, -20, 165);
    lv_obj_set_style_bg_color(sw_wifi, lv_color_hex(0x3be477), LV_PART_INDICATOR);

    lv_obj_t *bt_label = lv_label_create(scr_settings);
    lv_label_set_text(bt_label, "Bluetooth");
    lv_obj_set_style_text_color(bt_label, lv_color_white(), 0);
    lv_obj_align(bt_label, LV_ALIGN_TOP_LEFT, 20, 210);

    lv_obj_t *sw_bt = lv_switch_create(scr_settings);
    lv_obj_align(sw_bt, LV_ALIGN_TOP_RIGHT, -20, 205);
    lv_obj_add_state(sw_bt, LV_STATE_CHECKED);
    lv_obj_set_style_bg_color(sw_bt, lv_color_hex(0x3be477), LV_PART_INDICATOR);

    /* Info Button */
    lv_obj_t *btn_info = lv_btn_create(scr_settings);
    lv_obj_set_size(btn_info, 200, 40);
    lv_obj_align(btn_info, LV_ALIGN_BOTTOM_MID, 0, -20);
    lv_obj_set_style_bg_color(btn_info, lv_color_hex(0xa29bfe), 0);
    /* Register callback after all screens are created */
    btn_settings_info = btn_info;

    lv_obj_t *lbl_info = lv_label_create(btn_info);
    lv_label_set_text(lbl_info, LV_SYMBOL_CALL " System Info");
    lv_obj_center(lbl_info);

    /* Back Button */
    lv_obj_t *btn_back = lv_btn_create(scr_settings);
    lv_obj_set_size(btn_back, 60, 35);
    lv_obj_align(btn_back, LV_ALIGN_TOP_LEFT, 5, 5);
    lv_obj_set_style_bg_color(btn_back, lv_color_hex(0x5f6368), 0);
    /* Register callback after all screens are created */
    btn_settings_back = btn_back;

    lv_obj_t *lbl_back = lv_label_create(btn_back);
    lv_label_set_text(lbl_back, LV_SYMBOL_LEFT " Back");
    lv_obj_center(lbl_back);
}

/*-----------------------------------------------------------------------------
 * Create System Info Screen
 *---------------------------------------------------------------------------*/
/* This screen displays hardware and firmware information.
 * Contains: Title, Info card with specifications, Back button
 */
static void create_info_screen(void)
{
    scr_info = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_info, lv_color_hex(0x1a1a2e), 0);

    /* Title */
    lv_obj_t *title = lv_label_create(scr_info);
    lv_label_set_text(title, LV_SYMBOL_CALL " System Information");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

