Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/LVGL/lvgl_app.c
    /* Info Card */
    lv_obj_t *info_card = lv_obj_create(scr_info);
    lv_obj_set_size(info_card, 200, 200);
    lv_obj_center(info_card);
    lv_obj_set_style_bg_color(info_card, lv_color_hex(0x16213e), 0);
    lv_obj_set_style_border_color(info_card, lv_color_hex(0x0f4c75), 0);
    lv_obj_set_style_border_width(info_card, 2, 0);

    lv_obj_t *info_text = lv_label_create(info_card);
    lv_label_set_text(info_text,
        "MCU: STM32F429ZI\n"
        "Core: ARM Cortex-M4\n"
        "Freq: 180 MHz\n"
        "Flash: 2 MB\n"
        "RAM: 256 KB\n"
        "Display: 320x480\n"
        "LVGL: v9.4.x\n"
        "\n"
        "Status: Running");
    lv_obj_set_style_text_color(info_text, lv_color_hex(0x3be477), 0);
    lv_obj_set_style_text_font(info_text, &lv_font_montserrat_14, 0);
    lv_obj_center(info_text);

    /* Back Button */
    lv_obj_t *btn_back = lv_btn_create(scr_info);
    lv_obj_set_size(btn_back, 60, 35);
    lv_obj_align(btn_back, LV_ALIGN_TOP_LEFT, 5, 5);
    lv_obj_set_style_bg_color(btn_back, lv_color_hex(0x5f6368), 0);
    /* Register callback after all screens are created */
    btn_info_back = btn_back;

    lv_obj_t *lbl_back = lv_label_create(btn_back);
    lv_label_set_text(lbl_back, LV_SYMBOL_LEFT " Back");
    lv_obj_center(lbl_back);
}

static void create_pins_screen(void)
{
    scr_pins = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_pins, lv_color_hex(0x1a1a2e), 0);

    lv_obj_t *title = lv_label_create(scr_pins);
    lv_label_set_text(title, LV_SYMBOL_LIST " MCU Pins");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

    lv_obj_t *list = lv_list_create(scr_pins);
    lv_obj_set_size(list, 300, 380);
    lv_obj_align(list, LV_ALIGN_BOTTOM_MID, 0, -10);

    for (uint32_t i = 0; i < (sizeof(pin_table) / sizeof(pin_table[0])); i++) {
        lv_obj_t *btn = lv_list_add_btn(list, NULL, pin_table[i].name);
        lv_obj_add_event_cb(btn, pin_item_event_handler, LV_EVENT_CLICKED, (void *)&pin_table[i]);
    }

    lv_obj_t *btn_back = lv_btn_create(scr_pins);
    lv_obj_set_size(btn_back, 60, 35);
    lv_obj_align(btn_back, LV_ALIGN_TOP_LEFT, 5, 5);
    lv_obj_set_style_bg_color(btn_back, lv_color_hex(0x5f6368), 0);
    btn_pins_back = btn_back;

    lv_obj_t *lbl_back = lv_label_create(btn_back);
    lv_label_set_text(lbl_back, LV_SYMBOL_LEFT " Back");
    lv_obj_center(lbl_back);
}

static void create_pin_detail_screen(void)
{
    scr_pin_detail = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_pin_detail, lv_color_hex(0x1a1a2e), 0);

    lv_obj_t *title = lv_label_create(scr_pin_detail);
    lv_label_set_text(title, LV_SYMBOL_EDIT " Pin Detail");
    lv_obj_set_style_text_color(title, lv_color_white(), 0);
    lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

    pin_name_label = lv_label_create(scr_pin_detail);
    lv_label_set_text(pin_name_label, "Pin: --");
    lv_obj_set_style_text_color(pin_name_label, lv_color_white(), 0);
    lv_obj_align(pin_name_label, LV_ALIGN_TOP_LEFT, 20, 60);

    pin_port_label = lv_label_create(scr_pin_detail);
    lv_label_set_text(pin_port_label, "Port: --");
    lv_obj_set_style_text_color(pin_port_label, lv_color_white(), 0);
    lv_obj_align(pin_port_label, LV_ALIGN_TOP_LEFT, 20, 90);

    pin_nature_label = lv_label_create(scr_pin_detail);
    lv_label_set_text(pin_nature_label, "Nature: --");
    lv_obj_set_style_text_color(pin_nature_label, lv_color_white(), 0);
    lv_obj_align(pin_nature_label, LV_ALIGN_TOP_LEFT, 20, 120);

    pin_state_label = lv_label_create(scr_pin_detail);
    lv_label_set_text(pin_state_label, "State: --");
    lv_obj_set_style_text_color(pin_state_label, lv_color_white(), 0);
    lv_obj_align(pin_state_label, LV_ALIGN_TOP_LEFT, 20, 150);

    lv_obj_t *btn_back = lv_btn_create(scr_pin_detail);
    lv_obj_set_size(btn_back, 60, 35);
    lv_obj_align(btn_back, LV_ALIGN_TOP_LEFT, 5, 5);
    lv_obj_set_style_bg_color(btn_back, lv_color_hex(0x5f6368), 0);
    btn_pin_detail_back = btn_back;

    lv_obj_t *lbl_back = lv_label_create(btn_back);
    lv_label_set_text(lbl_back, LV_SYMBOL_LEFT " Back");
    lv_obj_center(lbl_back);
}

/*=============================================================================
 * PUBLIC API FUNCTIONS (Called from main.c)
 *===========================================================================*/

/*-----------------------------------------------------------------------------
 * Initialize LVGL Application
 *---------------------------------------------------------------------------*/
/* This is called ONCE at startup from main.c
 *
 * What it does:
 * 1. Initializes LVGL library
 * 2. Connects to display hardware
 * 3. Connects to touchscreen
 * 4. Creates all 4 screens
 * 5. Shows the home screen
 *
 * After this runs, call LVGL_App_Tick() repeatedly in your main loop.
 */
void LVGL_App_Init(void)
{
    log_debug("LVGL: Initializing application");
    /* Step 1: Initialize LVGL core */
    lv_init();

    /* Step 2: Initialize hardware ports */
    lv_port_disp_init();   /* Connect to display (LCD) */
    lv_port_indev_init();  /* Connect to input (touchscreen) */

    /* Step 3: Create all screens (order doesn't matter since callbacks are registered afterwards) */
    create_sensor_screen();
    create_settings_screen();
    create_info_screen();
    create_pins_screen();
    create_pin_detail_screen();
    create_home_screen();

    /* Register navigation callbacks now that all screen objects exist */
    if (btn_home_sensors) {
        lv_obj_add_event_cb(btn_home_sensors, nav_event_handler, LV_EVENT_CLICKED, scr_sensors);
    }
    if (btn_home_settings) {
        lv_obj_add_event_cb(btn_home_settings, nav_event_handler, LV_EVENT_CLICKED, scr_settings);
    }
    if (btn_sensors_back) {
        lv_obj_add_event_cb(btn_sensors_back, nav_event_handler, LV_EVENT_CLICKED, scr_home);
    }
    if (btn_settings_info) {
        lv_obj_add_event_cb(btn_settings_info, nav_event_handler, LV_EVENT_CLICKED, scr_info);
    }
    if (btn_settings_back) {
        lv_obj_add_event_cb(btn_settings_back, nav_event_handler, LV_EVENT_CLICKED, scr_home);
    }
    if (btn_info_back) {
        lv_obj_add_event_cb(btn_info_back, nav_event_handler, LV_EVENT_CLICKED, scr_settings);
    }
    if (btn_home_pins) {
        lv_obj_add_event_cb(btn_home_pins, nav_event_handler, LV_EVENT_CLICKED, scr_pins);
    }
    if (btn_pins_back) {
        lv_obj_add_event_cb(btn_pins_back, nav_event_handler, LV_EVENT_CLICKED, scr_home);
    }
    if (btn_pin_detail_back) {
        lv_obj_add_event_cb(btn_pin_detail_back, nav_event_handler, LV_EVENT_CLICKED, scr_pins);
    }

    /* Step 4: Load home screen as default */
    lv_screen_load(scr_home);

    /* Force a refresh to ensure the screen is displayed */
    lv_refr_now(NULL);
    log_debug("LVGL: Application initialized successfully");
}

/*-----------------------------------------------------------------------------
 * LVGL Tick Handler - Process LVGL Tasks
 *---------------------------------------------------------------------------*/
/* Call this function periodically (every 1-5ms) in your main loop.
 *
 * What it does:
 * - Processes LVGL's internal timers
 * - Triggers redraws when needed
 * - Handles animations and user input
 *
 * Calling frequency:
 * - Faster (1ms): Smoother animations, more CPU usage
 * - Slower (5ms): Less smooth, saves CPU time
 * - Recommended: 5ms for most applications
 *
 * Example usage in main.c:
 *   while(1) {
 *     LVGL_App_Tick();
 *     HAL_Delay(5);  // 5ms delay = 200 times per second
 *   }
 *
 * Advanced: Call from a timer interrupt for precise timing
 */
void LVGL_App_Tick(void)
{
    lv_timer_handler();  /* Process LVGL's internal tasks */
}

/*-----------------------------------------------------------------------------
 * Helper Functions for Updating UI Elements
 *---------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
 * Update Temperature Display
 *---------------------------------------------------------------------------*/
void LVGL_App_UpdateTemperature(int temp_celsius)
{
    if(temp_arc != NULL) {
        lv_arc_set_value(temp_arc, temp_celsius);
    }

    if(temp_label != NULL) {
        static char temp_str[16];
        lv_snprintf(temp_str, sizeof(temp_str), "%d°C\nTemp", temp_celsius);
        lv_label_set_text(temp_label, temp_str);
    }
}

/*-----------------------------------------------------------------------------
 * Update Humidity Display
 *---------------------------------------------------------------------------*/
void LVGL_App_UpdateHumidity(int humidity_percent)
{
    if(humidity_bar != NULL) {
        lv_bar_set_value(humidity_bar, humidity_percent, LV_ANIM_ON);
    }

    if(humidity_label != NULL) {
        static char hum_str[16];
        lv_snprintf(hum_str, sizeof(hum_str), "%d%%\nHumid", humidity_percent);
        lv_label_set_text(humidity_label, hum_str);
    }
}

/*-----------------------------------------------------------------------------
 * Update Status Message
 *---------------------------------------------------------------------------*/
void LVGL_App_UpdateStatus(const char *status)
{
    if(status_label != NULL && status != NULL) {
        lv_label_set_text(status_label, status);
        /* Force a refresh of the label */
        lv_obj_invalidate(status_label);
    }
}

/*-----------------------------------------------------------------------------
 * Add Data Point to Sensor Chart
 *---------------------------------------------------------------------------*/
void LVGL_App_AddChartData(int value)
{
    if(chart_sensor != NULL && chart_series != NULL) {
        lv_chart_set_next_value(chart_sensor, chart_series, value);
    }
}
